

## NAME :  OSARIEME EHIMWENMA

In [1]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\hp\anaconda3\anaconda\lib\site-packages (0.4.1)
Requirement already satisfied: ipython>=1.0 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython-sql) (7.22.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython-sql) (1.4.7)
Requirement already satisfied: sqlparse in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython-sql) (0.4.3)
Requirement already satisfied: traitlets>=4.2 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: colorama in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: jedi>=0.16 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.2)
Requirement already satisfied: backcall in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: pygments in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (2.8.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (52.0.0.post20210125)
Requirement already satisfied: pickleshare in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.6)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.17)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\hp\anaconda3\anaconda\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.0.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\hp\anaconda3\anaconda\lib\site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\hp\anaconda3\anaconda\lib\site-packages (from SQLAlchemy) (1.0.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
%load_ext sql

In [4]:
%%sql 

sqlite:///flights.db

#Exploring the database 

Before we begin this challenge we can go ahead and take a look at the composition of each table in the flights database

In [5]:
%%sql 

PRAGMA table_info(flights);

 * sqlite:///flights.db
Done.

[(0, 'index', 'integer', 0, 'NULL', 0),
 (1, 'Date', 'longtext', 0, None, 0),
 (2, 'DayOfWeek', 'integer', 0, 'NULL', 0),
 (3, 'DepTime', 'double', 0, 'NULL', 0),
 (4, 'CRSDepTime', 'longtext', 0, None, 0),
 (5, 'ArrTime', 'double', 0, 'NULL', 0),
 (6, 'CRSArrTime', 'longtext', 0, None, 0),
 (7, 'UniqueCarrier', 'longtext', 0, None, 0),
 (8, 'FlightNum', 'longtext', 0, None, 0),
 (9, 'TailNum', 'longtext', 0, None, 0),
 (10, 'ActualElapsedTime', 'double', 0, 'NULL', 0),
 (11, 'CRSElapsedTime', 'longtext', 0, None, 0),
 (12, 'AirTime', 'longtext', 0, None, 0),
 (13, 'ArrDelay', 'double', 0, 'NULL', 0),
 (14, 'DepDelay', 'double', 0, 'NULL', 0),
 (15, 'Origin', 'longtext', 0, None, 0),
 (16, 'Dest', 'longtext', 0, None, 0),
 (17, 'Distance', 'integer', 0, 'NULL', 0),
 (18, 'TaxiIn', 'longtext', 0, None, 0),
 (19, 'TaxiOut', 'longtext', 0, None, 0),
 (20, 'Cancelled', 'longtext', 0, None, 0),
 (21, 'CancellationCode', 'longtext', 0, None, 0),
 (22, 'Diverted', 'longtext', 0, None, 0),
 (23, 'CarrierDelay', 'longtext', 0, None, 0),
 (24, 'WeatherDelay', 'longtext', 0, None, 0),
 (25, 'NASDelay', 'longtext', 0, None, 0),
 (26, 'SecurityDelay', 'longtext', 0, None, 0),
 (27, 'LateAircraftDelay', 'longtext', 0, None, 0)]

In [6]:
%%sql

SELECT *
FROM flights
LIMIT 5;

 * sqlite:///flights.db
Done.

[(0, '2008/1/3', 4, 2003.0, '1955', 2211.0, '2225', 'WN', '335', 'N712SW', 128.0, '150', '116.0', -14.0, 8.0, 'IAD', 'TPA', 810, '4', '8', '0', None, '0', None, None, None, None, None),
 (1, '2008/1/3', 4, 754.0, '735', 1002.0, '1000', 'WN', '3231', 'N772SW', 128.0, '145', '113.0', 2.0, 19.0, 'IAD', 'TPA', 810, '5', '10', '0', None, '0', None, None, None, None, None),
 (2, '2008/1/3', 4, 628.0, '620', 804.0, '750', 'WN', '448', 'N428WN', 96.0, '90', '76.0', 14.0, 8.0, 'IND', 'BWI', 515, '3', '17', '0', None, '0', None, None, None, None, None),
 (3, '2008/1/3', 4, 926.0, '930', 1054.0, '1100', 'WN', '1746', 'N612SW', 88.0, '90', '78.0', -6.0, -4.0, 'IND', 'BWI', 515, '3', '7', '0', None, '0', None, None, None, None, None),
 (4, '2008/1/3', 4, 1829.0, '1755', 1959.0, '1925', 'WN', '3920', 'N464WN', 90.0, '90', '77.0', 34.0, 34.0, 'IND', 'BWI', 515, '3', '10', '0', None, '0', '2', '0', '0', '0', '32')]

In [7]:
%%sql 

PRAGMA table_info(carriers);

 * sqlite:///flights.db
Done.

[(0, 'Code', 'varchar(10)', 0, 'NULL', 0),
 (1, 'Description', 'varchar(100)', 0, 'NULL', 0)]

In [8]:
%%sql

SELECT *
FROM carriers
LIMIT 5;

 * sqlite:///flights.db
Done.

[('02Q', 'Titan Airways\r'),
 ('04Q', 'Tradewind Aviation\r'),
 ('05Q', 'Comlux Aviation, AG\r'),
 ('06Q', 'Master Top Linhas Aereas Ltd.\r'),
 ('07Q', 'Flair Airlines Ltd.\r')]

In [9]:
%%sql 

PRAGMA table_info(airports);

 * sqlite:///flights.db
Done.

[(0, 'iata', 'varchar(10)', 0, 'NULL', 0),
 (1, 'airport', 'varchar(100)', 0, 'NULL', 0),
 (2, 'city', 'varchar(100)', 0, 'NULL', 0),
 (3, 'state', 'varchar(50)', 0, 'NULL', 0),
 (4, 'country', 'varchar(50)', 0, 'NULL', 0),
 (5, 'lat', 'float(24,0)', 0, 'NULL', 0),
 (6, 'long', 'float(24,0)', 0, 'NULL', 0)]

In [10]:
%%sql

SELECT *
FROM airports
LIMIT 5;

 * sqlite:///flights.db
Done.

[('00M', 'Thigpen ', 'Bay Springs', 'MS', 'USA', 32.0, -89.0),
 ('00R', 'Livingston Municipal', 'Livingston', 'TX', 'USA', 31.0, -95.0),
 ('00V', 'Meadow Lake', 'Colorado Springs', 'CO', 'USA', 39.0, -105.0),
 ('01G', 'Perry-Warsaw', 'Perry', 'NY', 'USA', 43.0, -78.0),
 ('01J', 'Hilliard Airpark', 'Hilliard', 'FL', 'USA', 31.0, -82.0)]

In [11]:
%%sql 

PRAGMA table_info(planes);

 * sqlite:///flights.db
Done.

[(0, 'tailnum', 'varchar(10)', 0, 'NULL', 0),
 (1, 'type', 'varchar(100)', 0, 'NULL', 0),
 (2, 'manufacturer', 'varchar(100)', 0, 'NULL', 0),
 (3, 'issue_date', 'varchar(100)', 0, 'NULL', 0),
 (4, 'model', 'varchar(50)', 0, 'NULL', 0),
 (5, 'status', 'varchar(100)', 0, 'NULL', 0),
 (6, 'aircraft_type', 'varchar(100)', 0, 'NULL', 0),
 (7, 'engine_type', 'varchar(100)', 0, 'NULL', 0),
 (8, 'year', 'longtext', 0, None, 0)]

In [12]:
%%sql

SELECT *
FROM planes
LIMIT 5;

 * sqlite:///flights.db
Done.

[('N050AA', None, None, None, None, None, None, None, None),
 ('N051AA', None, None, None, None, None, None, None, None),
 ('N052AA', None, None, None, None, None, None, None, None),
 ('N054AA', None, None, None, None, None, None, None, None),
 ('N055AA', None, None, None, None, None, None, None, None)]

**Question 1**

How many different carriers are there in total in the database?

**Options:**
- 1 252
- 1491
- 20
- 37

In [39]:
%%sql

SELECT COUNT(*) 
FROM carriers;

 * sqlite:///flights.db
Done.

[(1491,)]

# YOUR ANSWER HERE: 1491

**Question 2** 

How long was the longest delay before departure? 

**Options:**
- 1355 min
- 999 min
- 1099 min
- 588 min

In [38]:
%%sql
SELECT depdelay as "longest delay", dest, deptime
FROM flights
ORDER BY depdelay DESC
LIMIT 5;

 * sqlite:///flights.db
Done.

[(1355.0, 'DFW', 1805.0),
 (1275.0, 'MIA', 800.0),
 (1172.0, 'ORD', 1017.0),
 (1154.0, 'DFW', 729.0),
 (1120.0, 'DTW', 756.0)]

### YOUR ANSWER HERE:  1355 min

**Question 3** 

How many flights departed on the 28th of January 2008?

**Options:**
- 540 908
- 20 149
- 19 495
- 18 056

In [36]:
%%sql

SELECT COUNT(*) as "flight departed", date
FROM flights
WHERE date like'%2008/1/28%'
GROUP BY date
ORDER BY "date" DESC
LIMIT 5;

 * sqlite:///flights.db
Done.

[(20149, '2008/1/28')]

### YOUR ANSWER HERE:  20 149

**Question 4**
 
 What is the distance between Midway Airport (MDW) and Houston Airport (HOU)?
 
 **Options:**
 - 611 km
 - 972 km
 - 1 121 km
 - 937 km

In [35]:
%%sql

SELECT distance, origin, dest
FROM flights
WHERE origin like'%MDW%' and dest like'%HOU%'
ORDER BY distance DESC
LIMIT 1;

 * sqlite:///flights.db
Done.

[(937, 'MDW', 'HOU')]

### YOUR ANSWER HERE:  937 km

**Question 5**

Which day of the week had the highest number of cancelled flights?(Note 1 = cancelled , 0 = not cancelled;)


**Options:**
- Monday(1)
- Wednesday(3) 
- Saturday(6) 
- Thursday (4)

In [30]:
%%sql

SELECT COUNT(Date) as Date, dayofweek
FROM flights
WHERE Cancelled = 1
GROUP BY dayofweek
ORDER BY COUNT(date) DESC
LIMIT 5;

 * sqlite:///flights.db
Done.

[(3093, 4), (2993, 2), (2645, 3), (2617, 1), (2049, 5)]

### YOUR ANSWER HERE:  Thursday (4)

**Question 6**

How many airports have the word "International" in their name?

**Options:**
- 110
- 124
- 8
- 2

In [18]:
%%sql

SELECT COUNT(*) 
FROM airports
WHERE airport like '%international%';

 * sqlite:///flights.db
Done.

[(124,)]

### YOUR ANSWER HERE:  124

**Question 7**

What is the most produced model for the manufacturer "BOEING"?

**Options:**
- 717-200
- 737-7H4
- 757-222
- 737-3H4

In [31]:
%%sql

SELECT COUNT(manufacturer) as "most produced", model
FROM planes
WHERE manufacturer like'%BOEING%'
GROUP BY model
ORDER BY COUNT(manufacturer) DESC
LIMIT 5;

 * sqlite:///flights.db
Done.

[(308, '737-7H4'),
 (147, '737-3H4'),
 (112, '757-232'),
 (100, '737-824'),
 (98, '717-200')]

### YOUR ANSWER HERE:   737-7H4

**Question 8**

How many planes landed at Los Angeles International Airport? 

**Options:**
- 215 608
- 18 964
- 41 258
- 39 422

In [37]:
%%sql

SELECT COUNT(airport) as "planes landed", airport
FROM airports as A
JOIN flights as F
ON F.Dest = A.Iata
WHERE A.airport LIKE'%Los Angeles International%';

 * sqlite:///flights.db
Done.

[(18964, 'Los Angeles International')]

### YOUR ANSWER HERE:  18 964